Tekla Open API Reference for Tekla Structures 2025
Completeness Methods
The TaskFilterExpressions.Completeness type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
TaskFilterExpressions.Completeness Class
Tekla.Structures.Filtering.Categories Namespace